DerEffi/pixelart/esp32/Pixelart/src/main.cpp
#include <main.h>
#include <Arduino.h>

#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <Font4x5Fixed.h>
#include <Font4x7Fixed.h>
#include <Font5x5Fixed.h>
#include <Font5x7Fixed.h>
#include <SPI.h>
#include <SPIFFS.h>
#include <SD.h>
#include <Preferences.h>

#include <WiFi.h>
#include <ESPAsyncWebServer.h>
#include <ESPAsyncDNSServer.h>
#include <AsyncHTTPSRequest_Generic.h>
#include <ArduinoJson.h>
#include <AsyncJson.h>

#include <time.h>
#include <Wire.h>
#include <RTClib.h>
#include <ESP32Time.h>




/**************
**	Globals  **
***************/

//TODO remove Tests
unsigned long ms_test = 0;
uint32_t lastHeap = 0;

//colors
const uint16_t color_twitch = 25108;
const uint16_t color_youtube = 0xF800;
const uint16_t color_coral = 0xFC10;

//bitmaps
const uint8_t icon_person[7] = {0x78, 0x48, 0x48, 0x78, 0x00, 0xfc, 0x84}; //6x7
const uint8_t icon_sun[7] = {0x10, 0x44, 0x38, 0xba, 0x38, 0x44, 0x10}; //7x7
const uint8_t icon_star[7] = {0x10, 0x38, 0xfe, 0x7c, 0x38, 0x6c, 0x44}; //7x7
const uint8_t icon_heart[7] = {0x66, 0xff, 0xff, 0xff, 0x7e, 0x3c, 0x18}; //8x7
const uint8_t icon_bell[7] = {0x00, 0x30, 0x78, 0xfc, 0xfc, 0x00, 0x10}; //6x7
const uint8_t icon_eye[14] = {0x1c, 0x00, 0x22, 0x00, 0x49, 0x00, 0x9c, 0x80, 0x49, 0x00, 0x22, 0x00, 0x1c, 0x00}; //9x7

const uint8_t icon_twitch[120] = {0x0f, 0xff, 0xff, 0xf0, 0x1f, 0xff, 0xff, 0xf0, 0x30, 0x00, 0x00, 0x30, 0x70, 0x00, 0x00, 0x30, 0xf0, 0x00, 0x00, 0x30, 0xf0, 0x00, 0x00, 0x30, 0xf0, 0x00, 0x00, 0x30, 0xf0, 0x18, 0x0c, 0x30, 0xf0, 0x18, 0x0c, 0x30, 0xf0, 0x18, 0x0c, 0x30, 0xf0, 0x18, 0x0c, 0x30, 0xf0, 0x18, 0x0c, 0x30, 0xf0, 0x18, 0x0c, 0x30, 0xf0, 0x18, 0x0c, 0x30, 0xf0, 0x18, 0x0c, 0x30, 0xf0, 0x00, 0x00, 0x30, 0xf0, 0x00, 0x00, 0x30, 0xf0, 0x00, 0x00, 0x30, 0xf0, 0x00, 0x00, 0x30, 0xf0, 0x00, 0x00, 0x30, 0xf0, 0x00, 0x00, 0x70, 0xf0, 0x00, 0x00, 0xf0, 0xf0, 0x00, 0x01, 0xe0, 0xff, 0xf1, 0xff, 0xc0, 0xff, 0xf3, 0xff, 0x80, 0xff, 0xf7, 0xff, 0x00, 0xff, 0xff, 0xfe, 0x00, 0x01, 0xc0, 0x00, 0x00, 0x01, 0x80, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00}; //28x30
const uint8_t icon_youtube_base[96] = {0x0f, 0xff, 0xff, 0xf0, 0x3f, 0xff, 0xff, 0xfc, 0x7f, 0xff, 0xff, 0xfe, 0x7f, 0xff, 0xff, 0xfe, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0x7f, 0xff, 0xff, 0xfe, 0x7f, 0xff, 0xff, 0xfe, 0x3f, 0xff, 0xff, 0xfc, 0x0f, 0xff, 0xff, 0xf0}; //32x24
const uint8_t icon_youtube_play[24] = {0x80, 0x00, 0xc0, 0x00, 0xf0, 0x00, 0xfc, 0x00, 0xfe, 0x00, 0xff, 0x80, 0xff, 0x80, 0xfe, 0x00, 0xfc, 0x00, 0xf0, 0x00, 0xc0, 0x00, 0x80, 0x00}; //9x12

const uint8_t marks_clock[44][2] = {{0,31},{1,31},{2,31},{3,31},{0,32},{1,32},{2,32},{3,32},{60,31},{61,31},{62,31},{63,31},{60,32},{61,32},{62,32},{63,32},{31,0},{31,1},{31,2},{31,3},{32,0},{32,1},{32,2},{32,3},{31,60},{31,61},{31,62},{31,63},{32,60},{32,61},{32,62},{32,63},{16,5},{47,5},{58,16},{58,47},{5,16},{5,47},{16,58},{47,58},{32,32},{31,31},{32,31},{31,32}};

//slopes for mapping ranges to pixel width
//? (output_end - output_start) / (input_end - input_start)
const double slope_brightness = .196;
const double slope_diashow = 0;
const double slope_animation = 0;

//structs
enum overlay_type {
	OVERLAY_NONE,
	OVERLAY_BRIGHTNESS,
	OVERLAY_ANIMATION_SPEED,
	OVERLAY_DIASHOW_SPEED,
	OVERLAY_TEXT
};

#define DISPLAY_MODE_NUMBER 3
enum display_mode {
	MODE_SOCIALS,
	MODE_IMAGES,
	MODE_CLOCK,
};

#define CLOCK_TYPE_NUMBER 4
enum clock_type {
	CLOCK_ANALOG,
	CLOCK_DIGITAL,
	CLOCK_DIGITAL_DATE,
	CLOCK_DIGITAL_BIG
};

struct socials_channel {
	char* type;
	char* name;
	char* follower;
	char* views;
	socials_channel(char* type, char* name, char* follower, char* views):
	type(type), name(name), follower(follower), views(views) {}
};

struct image_meta {
	char* image;
	char* animation;
	bool animated;
	image_meta(char* image, bool animated = false, char* animation = nullptr):
	image(image), animation(animation), animated(animated) {}
};

//settings
Preferences preferences;
bool booted = false;
unsigned long ms_current = 0;
bool requested_reset = false;

overlay_type overlay = OVERLAY_NONE;
char* overlay_text = strdup("");
unsigned long ms_overlay = 0;
uint8_t brightness = 128;


//Wifi
bool wifi_connect = WIFI_CONNECT_DEFAULT;
bool wifi_host = WIFI_HOST_DEFAULT;
bool wifi_setup_complete = true;
char* wifi_ssid = strdup(WIFI_SSID_DEFAULT);
char* wifi_ap_ssid = strdup(WIFI_AP_SSID_DEFAULT);
char* wifi_password = strdup(WIFI_PASSWORD_DEFAULT);
char* wifi_ap_password = strdup(WIFI_AP_PASSWORD_DEFAULT);
unsigned long ms_wifi_routine = 0;
unsigned long ms_wifi_reconnect = 0;
AsyncDNSServer dnsServer;


//Server
AsyncWebServer server(80);
char* api_key = strdup("");
unsigned long ms_api_key_request = 0;
unsigned long ms_api_key_approve = 0;


//LED Panel
MatrixPanel_I2S_DMA *panel = nullptr;
display_mode current_mode = MODE_IMAGES;
bool display_change = false;

std::vector<image_meta> image_index; 
uint16_t current_image[64][64] = {};
bool image_loaded = false;

//Socials
AsyncHTTPSRequest http_socials;
char* socials_api_key = strdup(SOCIALS_API_KEY);
char* socials_request_server = strdup(SOCIALS_API_SERVER);
unsigned long ms_socials_request = 0;
unsigned long socials_response_check = 0;
char* socials_request = strdup(SOCIALS_REQUEST);
int socials_channel_current = 0;
std::vector<socials_channel> socials_channels;

//Clock
unsigned long ms_clock = 0;
clock_type current_clock_mode = CLOCK_ANALOG;
bool clock_seconds = true;
bool clock_blink = false;
bool clock_year = true;

//Interrupt flags
bool rot1_a_flag = false;
bool rot1_b_flag = false;
bool rot2_a_flag = false;
bool rot2_b_flag = false;
bool rot3_a_flag = false;
bool rot3_b_flag = false;

bool btn1_pressed = false;
bool btn2_pressed = false;
bool btn3_pressed = false;
bool rot1_pressed = false;
bool rot2_pressed = false;
bool rot3_pressed = false;
int rot1_clicks = 0;
int rot2_clicks = 0;
int rot3_clicks = 0;


