DerEffi/pixelart/esp32/Pixelart/src/main.cpp
//RTC
RTC_DS3231 rtc_ext;
ESP32Time rtc_int(0);
bool rtc_ext_enabled = false;
char* ntp_server = strdup(TIME_SERVER);
char* timezone = strdup(TIME_ZONE);
bool update_time = TIME_UPDATE_AUTO;
bool time_format24 = TIME_FORMAT24;
bool rtc_ext_adjust = false;
unsigned long ms_rtc_ext_adjust = 0;




/**************
**	Socials  **
***************/

void on_socials_response(){
	if(http_socials.responseHTTPcode() == 200) {
		DynamicJsonDocument socials_response_doc(8000);
		DeserializationError error = deserializeJson(socials_response_doc, http_socials.responseText());
		if(!error && socials_response_doc.is<JsonArray>()) {
			JsonArray socials_response_array = socials_response_doc.as<JsonArray>();

			//clear old data
			for(int i = 0; i < socials_channels.size(); i++) {
				free(socials_channels[i].follower);
				free(socials_channels[i].views);
				free(socials_channels[i].type);
				free(socials_channels[i].name);
			}
			socials_channels.clear();

			//fill with new data
			for(int i = 0; i < socials_response_array.size(); i++) {
				const char* t = socials_response_array[i]["t"].as<const char*>();
				const char* d = socials_response_array[i]["d"].as<const char*>();
				const char* c = socials_response_array[i]["c"].as<const char*>();
				const char* f = socials_response_array[i]["f"].as<const char*>();
				const char* v = socials_response_array[i]["v"].as<const char*>();
			
				socials_channel channel = {
					t ? strdup(t) : strdup(""),
					d ? strdup(d) : c ? strdup(c) : strdup(""),
					f ? strdup(f) : strdup("0"),
					v ? strdup(v) : strdup("0")
				};
				socials_channels.emplace_back(channel);
			}

			display_change = true;
		}
	}

	http_socials.abort();
	ms_socials_request = millis() + SOCIAL_REFRESH_INTERVAL;
}

void socials_refresh() {
	ms_socials_request = millis() + SOCIAL_REFRESH_INTERVAL;
	if(http_socials.readyState() == readyStateUnsent || http_socials.readyState() == readyStateDone) {
		char request_url[strlen(socials_request_server) + 9];
		strcpy(request_url, socials_request_server);
		strcat(request_url, "/socials");
		bool openResult = http_socials.open("POST", request_url);

		if(openResult) {
			http_socials.setReqHeader("Authorization", socials_api_key);
			http_socials.setReqHeader("Content-Type", "application/json");
			http_socials.setReqHeader("Accept", "application/json");
			if(http_socials.send(socials_request)) {
				socials_response_check = millis() + 500;
			}
		}
	}
}




/***********
**	Misc  **
************/
void rtc_internal_adjust() {
	DateTime time = rtc_ext.now();
	rtc_int.setTime(time.second(), time.minute(), time.hour(), time.day(), time.month(), time.year());
}

void rtc_external_adjust() {
	if(rtc_ext_enabled) {
		struct tm timeinfo;
		if(getLocalTime(&timeinfo, 500))
		{
			rtc_ext.adjust(DateTime(timeinfo.tm_year + 1900, timeinfo.tm_mon + 1, timeinfo.tm_mday, timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec));
		}
	}
	rtc_ext_adjust = false;
	ms_rtc_ext_adjust = 0;
}

void wifi_on_connected() {
	if(update_time) {
		configTzTime(timezone, ntp_server);
		if(rtc_ext_enabled) {
			ms_rtc_ext_adjust = millis() + 10000;
			rtc_ext_adjust = true;
		}
	}

	socials_refresh();
}

char* generate_uid(){
  /* Change to allowable characters */
  const char possible[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789";
  static char uid[33];
  for(int p = 0, i = 0; i < 32; i++){
    int r = random(0, strlen(possible));
    uid[p++] = possible[r];
  }
  uid[32] = '\0';
  return uid;
}

bool verify_api_key(AsyncWebServerRequest * request) {
	return request->hasHeader("apiKey") && request->getHeader("apiKey")->value().equals(api_key);
}




/************
**	SPFFS  **
*************/

bool compare_image_name(image_meta i1, image_meta i2) {
	return strcmp(i1.image, i2.image) < 0;
}

//reindex images folder of sd card for loading and diplaying byte data
void sd_index() {

	//remove old data from index
	for(int i = 0; i < image_index.size(); i++) {
		free(image_index[i].image);
		free(image_index[i].animation);
	}
	image_index.clear();

	//fill vector with new data
	if(SD.exists("/images")) {
		File folder = SD.open("/images");
		if(folder.isDirectory()) {
			char file_path[255]; 
			File image = folder.openNextFile();
			while(image) {
				if(image.isDirectory()) {
					const char* path = image.path();
					strcpy(file_path, path);
					strcat(file_path, "/image.pxart");

					if(SD.exists(file_path) && !SD.open(file_path).isDirectory()) {
						image_meta meta = {
							strdup(file_path)
						};
						
						strcpy(file_path, path);
						strcat(file_path, "/animation.pxart");
						if(SD.exists(file_path) && !SD.open(file_path).isDirectory()) {
							meta.animated = true;
							meta.animation = strdup(file_path);
						}
						
						image_index.emplace_back(meta);
					}
				}
				image = folder.openNextFile();
			}
		}
	}

	//sort vector by image name
	std::sort(image_index.begin(), image_index.end(), compare_image_name);
}

bool sd_connected() {
	if(SD.exists("/"))
		return true;
	
	SD.end();
	if(!SD.begin(GPIO_SD_CS, SPI))
		return false;
	
	bool success = SD.exists("/");
	if(success)
		sd_index();
	
	return success;
}

bool sd_load_image(char* path) {
	if(SD.exists(path)) {
		File file = SD.open(path);

		int x = 0;
		int y = 0;
		int position = 0;
		int length = file.available();
		const static int buffersize = 512;
		char color_data[buffersize] = {};

		//read in 4 pixelmatrix lines because of array size limit
		while(length > position + buffersize) {
			file.seek(position);
			file.readBytes(color_data, buffersize);

			for(int i = 0; i < buffersize; i += 2) {
				current_image[y][x] = (color_data[i+1] << 8) + color_data[i];
				x++;
				if(x >= 64) {
					x = 0;
					y++;
				}
				if(y >= 64)
					return true;
			}

			position += buffersize;
		}

		return true;
	}
	
	return false;
}




/**************
**	Display  **
**************/

//Display overlay menu for io switches
void display_overlay() {
	
	if(overlay != OVERLAY_NONE) {
		//Background
		panel->fillRect(0, 0, 64, 11, 0);
		
		if(overlay == OVERLAY_BRIGHTNESS) {
			//Progress Bar
			panel->drawRect(2, 2, 49, 7, 0xFFFF);

			//maps brightness range to progress bar width
			//? floor(output_start + (slope * (input - input_start)) + 0.5)
			panel->fillRect(4, 4, floor((1 + slope_brightness * (brightness - 24)) + .5), 3, 0xFFFF);
		
			//Sun icon
			panel->drawBitmap(54, 2, icon_sun, 7, 7, 0xFFFF);
		} else if(overlay == OVERLAY_ANIMATION_SPEED) {

		} else if(overlay == OVERLAY_DIASHOW_SPEED) {

		} else if(overlay == OVERLAY_TEXT) {

