DerEffi/pixelart/esp32/Pixelart/src/main.cpp
		}
	}
}

// load image into current pixelarray
void load_current_image(uint16_t pixels[64][64]) {
	for(int y = 0; y < 64; y++) {
		for(int x = 0; x < 64; x++) {
			current_image[y][x] = pixels[y][x];
		}
	}
}

// Display static images on led matrix by pixelarray
void display_full(uint16_t pixels[64][64], bool save_image = true) {
	for(int y = 0; y < 64; y++) {
		for(int x = 0; x < 64; x++) {
			if(save_image)
				current_image[y][x] = pixels[y][x];
			panel->drawPixel(x, y, pixels[y][x]);
		}
	}

	display_overlay();

	if(PANEL_DOUBLE_BUFFER)
		panel->flipDMABuffer();
}

//Displays twitch channel with respective viewers / subs
void display_social_channel(char* type, char* channel, char* subs, char* views) {

	//transparent background
	panel->clearScreen();

	//social icon
	if(strcmp(type, "t") == 0) {
			panel->drawBitmap(18, 2, icon_twitch, 28, 30, color_twitch);
	} else if (strcmp(type, "y") == 0) {
			panel->drawBitmap(16, 5, icon_youtube_base, 32, 24, color_youtube);
			panel->drawBitmap(28, 11, icon_youtube_play, 9, 12, 0xFFFF);
	}

	//text props
	int16_t x1, y1;
	uint16_t width, height;
	panel->setTextColor(0xFFFF);
	panel->setTextSize(1);

	panel->getTextBounds(channel, 0, 0, &x1, &y1, &width, &height);
	panel->setCursor(64 > width ? .5 * (64 - width) : 0, 42);
	panel->write(channel);

	int textbox_start_position = 0;
	int textbox_offset = 0;

	//follows - subs
	if(strcmp(subs, "") != 0 && strcmp(subs, "0") != 0) {
		if(strcmp(type, "t") == 0)
			textbox_offset = 10;
		else if (strcmp(type, "y") == 0)
			textbox_offset = 8;
		panel->getTextBounds(subs, 0, 0, &x1, &y1, &width, &height);
		textbox_start_position = 64 - textbox_offset > width ? .5 * (64 - textbox_offset - width) : 0;
		panel->setCursor(textbox_start_position + textbox_offset, 52);
		panel->write(subs);
	}

	//subs icon
	if(strcmp(type, "t") == 0)
		panel->drawBitmap(textbox_start_position, 45, icon_heart, 8, 7, color_twitch);
	else if (strcmp(type, "y") == 0)
		panel->drawBitmap(textbox_start_position, 45, icon_bell, 6, 7, 0xFFFF);

	//views
	if(strcmp(views, "") != 0 && strcmp(views, "0") != 0) {
		textbox_offset = 0;
		if(strcmp(type, "t") == 0)
			textbox_offset = 8;
		else if (strcmp(type, "y") == 0)
			textbox_offset = 11;
		panel->getTextBounds(views, 0, 0, &x1, &y1, &width, &height);
		textbox_start_position = 64 - textbox_offset > width ? .5 * (64 - textbox_offset - width) : 0;
		panel->setCursor(textbox_start_position + textbox_offset, 62);
		panel->write(views);

		//views icon
		if(strcmp(type, "t") == 0)
			panel->drawBitmap(textbox_start_position, 55, icon_person, 6, 7, color_coral);
		if(strcmp(type, "y") == 0)
			panel->drawBitmap(textbox_start_position, 55, icon_eye, 9, 7, 0xFFFF);
	}

	display_overlay();

	//print on screen
	if(PANEL_DOUBLE_BUFFER)
		panel->flipDMABuffer();
}

void display_clock_analog() {

	panel->clearScreen();

	//hands
	int hour = rtc_int.getHour();
	int minute = rtc_int.getMinute();

	//hour hand
	int hourX = (hour >= 6 ? 31 : 32);
	int hourY = (hour >= 9 || hour <= 3 ? 31 : 32);
	float radiant_hour = radians(180 - (30 * hour) - (minute / 2));
	panel->drawLine(hourX + 15 * sin(radiant_hour), hourY + 15 * cos(radiant_hour), hourX, hourY, 0xFFFF);
	
	//minute hand
	int minuteX = (minute >= 30 ? 31 : 32);
	int minuteY = (minute >= 45 || minute <= 15 ? 31 : 32);
	float radiant_minute = radians(180 - (6 * minute));
	panel->drawLine(minuteX + 23 * sin(radiant_minute), minuteY + 23 * cos(radiant_minute), minuteX, minuteY, 0xFFFF);
	
	//second hand
	if(clock_seconds) {
		int second = rtc_int.getSecond();
		int secondX = (second >= 30 ? 31 : 32);
		int secondY = (second >= 45 || second <= 15 ? 31 : 32);
		float radiant_second = radians(180 - (6 * second));
		panel->drawLine(secondX + 28 * sin(radiant_second), secondY + 28 * cos(radiant_second), secondX, secondY, 0xF800);
	}

	//marks
	for(int mark = 0; mark < 44; mark++) {
		panel->drawPixel(marks_clock[mark][0], marks_clock[mark][1], 0xFFFF);
	}

	display_overlay();

	if(PANEL_DOUBLE_BUFFER)
		panel->flipDMABuffer();
}

void display_clock_digital(bool withDate) {
	
	//transparent background
	panel->clearScreen();

	int hour = rtc_int.getHour(time_format24);
	int minute = rtc_int.getMinute();
	int second = rtc_int.getSecond();

	//text props
	panel->setTextColor(0xFFFF);
	panel->setTextSize(2);
	
	char clockText[10];
	int x_start;
	int y_start = 39;

	if(withDate) {
		int year = rtc_int.getYear();
		int month = rtc_int.getMonth() + 1;
		int day = rtc_int.getDay();
		y_start = 49;
		if(clock_year) {
			x_start = 5;
			sprintf(clockText, "%02d.%02d.%02d", day, month, year % 100);
		} else {
			x_start = 14;
			sprintf(clockText, "%02d.%02d.", day, month);
		}
		panel->setCursor(x_start, clock_seconds ? 29 : 25);
		panel->write(clockText);
	}

	
	if(clock_seconds) {
		x_start = 5;
		sprintf(clockText, "%02d:%02d:%02d", hour, minute, second);
	} else {
		x_start = 6;
		y_start += 4;
		panel->setTextSize(3);
		if(clock_blink && second % 2 == 1)
			sprintf(clockText, "%02d %02d", hour, minute);
		else
			sprintf(clockText, "%02d:%02d", hour, minute);
	}

	panel->setCursor( x_start, y_start);
	panel->write(clockText);

	display_overlay();

	if(PANEL_DOUBLE_BUFFER)
		panel->flipDMABuffer();
}

void display_clock_big() {

	//transparent background
	panel->clearScreen();

	int hour = rtc_int.getHour(time_format24);
	int minute = rtc_int.getMinute();

	//text props
	panel->setFont(&Font4x5Fixed);
	panel->setTextColor(0xFFFF);
	panel->setTextSize(5);
	
	char clockText[4];

	sprintf(clockText, "%02d", hour);
	panel->setCursor(14, 25);
	panel->write(clockText);

	sprintf(clockText, "%02d", minute);
	panel->setCursor(14, 54);
	panel->write(clockText);

	panel->setFont(&Font4x7Fixed);
	display_overlay();

	if(PANEL_DOUBLE_BUFFER)
		panel->flipDMABuffer();
}

void display_current() {
	switch(current_mode) {
		case MODE_SOCIALS:
			//go to next mode if wifi wont be connected
			if(!wifi_connect) {
				current_mode = MODE_IMAGES;
				display_change = true;
				break;
			}

			if(socials_channels.size() > 0) {
				if(socials_channels.size() < socials_channel_current)
					socials_channel_current = 0;

				display_social_channel(
					socials_channels[socials_channel_current].type,
					socials_channels[socials_channel_current].name,
					socials_channels[socials_channel_current].follower,
					socials_channels[socials_channel_current].views
				);
			} else {
				char * channel_type = strdup("");
				char * channel_name = strdup("Loading");
				char * channel_follower = strdup("");
				char * channel_views = strdup("");
				
				display_social_channel(channel_type, channel_name, channel_follower, channel_views);

				free(channel_type);
				free(channel_name);
				free(channel_follower);
				free(channel_views);
			}

			break;
		case MODE_CLOCK:
			switch(current_clock_mode) {
				case CLOCK_ANALOG:
					display_clock_analog();
					break;
				case CLOCK_DIGITAL:
					display_clock_digital(false);
					break;
				case CLOCK_DIGITAL_DATE:
					display_clock_digital(true);
					break;
				case CLOCK_DIGITAL_BIG:
					display_clock_big();
					break;
			}
			break;
		case MODE_IMAGES:
			display_full(current_image, false);
			break;
	}
}




/*****************
**	Interrupts  **
******************/

void IRAM_ATTR trigger_btn1() {
	btn1_pressed = true;
}

void IRAM_ATTR trigger_btn2() {
	btn2_pressed = true;
}

void IRAM_ATTR trigger_btn3() {
	btn3_pressed = true;
}


void IRAM_ATTR trigger_rot1_a() {
	if(rot1_a_flag && digitalRead(GPIO_ROT1_B) == LOW) {
		rot1_a_flag = false;
		rot1_b_flag = false;
		rot1_clicks--;
	} else {
		rot1_b_flag = true;
	}
}

void IRAM_ATTR trigger_rot1_b() {
	if(rot1_b_flag && digitalRead(GPIO_ROT1_A) == LOW) {
		rot1_a_flag = false;
		rot1_b_flag = false;
		rot1_clicks++;
	} else {
		rot1_a_flag = true;
	}
}

void IRAM_ATTR trigger_rot1_btn() {
	rot1_pressed = true;
}


void IRAM_ATTR trigger_rot2_a() {
	if(rot2_a_flag && digitalRead(GPIO_ROT2_B) == LOW) {
		rot2_a_flag = false;
		rot2_b_flag = false;
		rot2_clicks--;
	} else {
		rot2_b_flag = true;
	}
}

void IRAM_ATTR trigger_rot2_b() {
	if(rot2_b_flag && digitalRead(GPIO_ROT2_A) == LOW) {
		rot2_a_flag = false;
		rot2_b_flag = false;
		rot2_clicks++;
	} else {
		rot2_a_flag = true;
	}
}

void IRAM_ATTR trigger_rot2_btn() {
	rot2_pressed = true;
}


void IRAM_ATTR trigger_rot3_a() {
	if(rot3_a_flag && digitalRead(GPIO_ROT3_B) == LOW) {
		rot3_a_flag = false;
		rot3_b_flag = false;
		rot3_clicks--;
	} else {
		rot3_b_flag = true;
	}
}

void IRAM_ATTR trigger_rot3_b() {
	if(rot3_b_flag && digitalRead(GPIO_ROT3_A) == LOW) {
		rot3_a_flag = false;
		rot3_b_flag = false;
		rot3_clicks++;
	} else {
		rot3_a_flag = true;
	}
}

