DerEffi/pixelart/esp32/Pixelart/src/main.cpp
void IRAM_ATTR trigger_rot3_btn() {
	rot3_pressed = true;
}




/************
**	Setup  **
*************/

//Initialize GPIO Pins
void gpio_setup() {

	//Turning off onboard led
	pinMode(48, PULLDOWN);

	//Setting PinModes
	pinMode(GPIO_BTN1, PULLUP);
	pinMode(GPIO_BTN2, PULLUP);
	pinMode(GPIO_BTN3, PULLUP);
	pinMode(GPIO_ROT1_A, PULLUP);
	pinMode(GPIO_ROT1_B, PULLUP);
	pinMode(GPIO_ROT1_BTN, PULLUP);
	pinMode(GPIO_ROT2_A, PULLUP);
	pinMode(GPIO_ROT2_B, PULLUP);
	pinMode(GPIO_ROT2_BTN, PULLUP);
	pinMode(GPIO_ROT3_A, PULLUP);
	pinMode(GPIO_ROT3_B, PULLUP);
	pinMode(GPIO_ROT3_BTN, PULLUP);

	//Setting interrupts
	attachInterrupt(GPIO_BTN1, trigger_btn1, FALLING);
	attachInterrupt(GPIO_BTN2, trigger_btn2, FALLING);
	attachInterrupt(GPIO_BTN3, trigger_btn3, FALLING);
	attachInterrupt(GPIO_ROT1_A, trigger_rot1_a, FALLING);
	attachInterrupt(GPIO_ROT1_B, trigger_rot1_b, FALLING);
	attachInterrupt(GPIO_ROT1_BTN, trigger_rot1_btn, FALLING);
	attachInterrupt(GPIO_ROT2_A, trigger_rot2_a, FALLING);
	attachInterrupt(GPIO_ROT2_B, trigger_rot2_b, FALLING);
	attachInterrupt(GPIO_ROT2_BTN, trigger_rot2_btn, FALLING);
	attachInterrupt(GPIO_ROT3_A, trigger_rot3_a, FALLING);
	attachInterrupt(GPIO_ROT3_B, trigger_rot3_b, FALLING);
	attachInterrupt(GPIO_ROT3_BTN, trigger_rot3_btn, FALLING);

	//I2C
	Wire.setPins(GPIO_RTC_SDA, GPIO_RTC_SCL);
  	Wire.begin();

	//SPI
	SPI.begin(GPIO_SD_SCLK, GPIO_SD_MISO, GPIO_SD_MOSI, GPIO_SD_CS);
	SD.begin(GPIO_SD_CS, SPI);
}

// Initialize LED Matrix
void panel_setup() {

	HUB75_I2S_CFG mxconfig(
		64,
		64,
		1,
		{
			GPIO_LEDPANEL_R1,
			GPIO_LEDPANEL_G1,
			GPIO_LEDPANEL_B1,
			GPIO_LEDPANEL_R2,
			GPIO_LEDPANEL_G2,
			GPIO_LEDPANEL_B2,
			GPIO_LEDPANEL_A,
			GPIO_LEDPANEL_B,
			GPIO_LEDPANEL_C,
			GPIO_LEDPANEL_D,
			GPIO_LEDPANEL_E,
			GPIO_LEDPANEL_LAT,
			GPIO_LEDPANEL_OE,
			GPIO_LEDPANEL_CLK
		},
		PANEL_DRIVER,
		PANEL_DOUBLE_BUFFER,
		PANEL_I2C_SPEED,
		PANEL_LATCH_BLINK,
		PANEL_CLOCK_PHASE
	);

	// Display Setup
	panel = new MatrixPanel_I2S_DMA(mxconfig);
	panel->begin();
	panel->clearScreen();
	panel->setPanelBrightness(brightness);
	panel->setFont(&Font4x7Fixed);
	panel->setTextWrap(false);

	if(PANEL_DOUBLE_BUFFER)
		panel->flipDMABuffer();

}

//Server setup
void server_setup() {
	if(WiFi.getMode() != WIFI_MODE_NULL) {
		
		server.begin();
		server.onNotFound([](AsyncWebServerRequest *request) {
			request->send(404, "application/json", String());
		});

		//webserver
		server.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
			if(sd_connected && SD.exists("/webserver/index.html")) {
				request->send(SD, "/webserver/index.html", String());
			} else {
				request->send(200, "text/plain", "SD Card or Files missing");
			}
		});

		server.on("/style.css", HTTP_GET, [](AsyncWebServerRequest *request) {
			if(sd_connected && SD.exists("/webserver/style.css")) {
				request->send(SD, "/webserver/style.css", "text/css");
			} else {
				request->send(200, "text/plain", "SD Card or Files missing");
			}
		});

		//API trigger
		server.on("/api/display", HTTP_GET, [](AsyncWebServerRequest * request) {
			if(verify_api_key(request)) {
				AsyncJsonResponse *response = new AsyncJsonResponse();
				response->setContentType("application/json");
				response->setCode(200);
				JsonVariant& root = response->getRoot();

				root["displayMode"] = current_mode;
				root["brightness"] = brightness;
				root["version"] = VERSION;

				response->setLength();
				request->send(response);
			} else {
				request->send(403, "application/json", "{}");
			}
		});

		server.on("/api/socials", HTTP_GET, [](AsyncWebServerRequest * request) {
			if(verify_api_key(request)) {
				AsyncJsonResponse *response = new AsyncJsonResponse();
				response->setContentType("application/json");
				response->setCode(200);
				JsonVariant& root = response->getRoot();

				root["request"] = socials_request;
				root["server"] = socials_request_server;
				root["displayChannel"] = socials_channel_current;

				response->setLength();
				request->send(response);
			} else {
				request->send(403, "application/json", "{}");
			}
		});

		server.on("/api/time", HTTP_GET, [](AsyncWebServerRequest * request) {
			if(verify_api_key(request)) {
				AsyncJsonResponse *response = new AsyncJsonResponse();
				response->setContentType("application/json");
				response->setCode(200);
				JsonVariant& root = response->getRoot();

				root["online"] = ms_current;
				root["time"] = rtc_int.getLocalEpoch();
				root["displayMode"] = current_clock_mode;
				root["seconds"] = clock_seconds;
				root["year"] = clock_year;
				root["blink"] = clock_blink;
				root["format24"] = time_format24;
				root["externalRTCConnected"] = rtc_ext_enabled;
				root["updateTime"] = update_time;
				root["ntpServer"] = ntp_server;
				root["timezone"] = timezone;

				response->setLength();
				request->send(response);
			} else {
				request->send(403, "application/json", "{}");
			}
		});

		server.on("/api/wifi", HTTP_GET, [](AsyncWebServerRequest * request) {
			if(verify_api_key(request)) {
				AsyncJsonResponse *response = new AsyncJsonResponse();
				response->setContentType("application/json");
				response->setCode(200);
				JsonVariant& root = response->getRoot();

				root["wifiAP"] = wifi_host;
				root["wifiAPSSID"] = wifi_ap_ssid;
				root["wifiAPPassword"] = wifi_ap_password;
				root["wifiAPIP"] = WiFi.softAPIP();

				root["wifiConnect"] = wifi_connect;
				root["wifiSetupComplete"] = wifi_setup_complete;
				root["wifiSSID"] = wifi_ssid;
				root["wifiIP"] = WiFi.localIP();
				root["wifiHostname"] = WiFi.getHostname();
				
				response->setLength();
				request->send(response);
			} else {
				request->send(403, "application/json", "{}");
			}
		});

		server.on("/api/refresh", HTTP_POST, [](AsyncWebServerRequest * request) {
			if(verify_api_key(request)) {
				display_change = true;
				request->send(200, "application/json");
			} else {
				request->send(403, "application/json");
			}
		});

		server.on("/api/apiKey", HTTP_DELETE, [](AsyncWebServerRequest * request) {
			if(verify_api_key(request)) {
				preferences.begin(PREFERENCES_NAMESPACE, false);
				api_key = generate_uid();
				preferences.putString("api_key", api_key);
				preferences.end();
				request->send(200);
			} else {
				request->send(403, "application/json");
			}
		});

		server.on("/api/apiKey", HTTP_GET, [](AsyncWebServerRequest * request) {
			AsyncJsonResponse *response = new AsyncJsonResponse();
			response->setContentType("application/json");
			JsonVariant& root = response->getRoot();

			if(ms_api_key_approve > millis()) {
				response->setCode(200);
				root["apiKey"] = api_key;
				ms_api_key_approve = 0;
				ms_api_key_request = 0;
			} else {
				ms_api_key_request = millis() + 5000;
				response->setCode(204);
			}
			
