DerEffi/pixelart/esp32/Pixelart/src/main.cpp
			response->setLength();
			request->send(response);
		});

		server.on("/api/reset", HTTP_POST, [](AsyncWebServerRequest * request) {
			if(verify_api_key(request)) {
				preferences.begin(PREFERENCES_NAMESPACE, false);
				preferences.clear();
				preferences.end();
				request->send(200);
				requested_reset = true;
			} else {
				request->send(403, "application/json");
			}
		});

		//API Data processors
		server.addHandler(new AsyncCallbackJsonWebHandler("/api/time", [](AsyncWebServerRequest * request, JsonVariant &json) {
			if(verify_api_key(request)) {
				JsonObject body = json.as<JsonObject>();
				preferences.begin(PREFERENCES_NAMESPACE);
				
				if(body.containsKey("seconds") && body["seconds"].is<bool>()) {
					clock_seconds = body["seconds"].as<bool>();
					preferences.putBool("clock_seconds", clock_seconds);
				}
				if(body.containsKey("blink") && body["blink"].is<bool>()) {
					clock_blink = body["blink"].as<bool>();
					preferences.putBool("clock_blink", clock_blink);
				}
				if(body.containsKey("year") && body["year"].is<bool>()) {
					clock_year = body["year"].as<bool>();
					preferences.putBool("clock_year", clock_year);
				}
				if(body.containsKey("format24") && body["format24"].is<bool>()) {
					time_format24 = body["format24"].as<bool>();
					preferences.putBool("time_format24", time_format24);
				}
				if(body.containsKey("updateTime") && body["updateTime"].is<bool>()) {
					update_time = body["updateTime"].as<bool>();
					preferences.putBool("update_time", update_time);
				}
				if(body.containsKey("timezone") && body["timezone"].is<const char*>()) {
					free(timezone);
					timezone = strdup(body["timezone"]);
					preferences.putString("timezone", timezone);
					setenv("TZ", timezone, 1);
					tzset();
				}
				if(body.containsKey("ntpServer") && body["ntpServer"].is<const char*>()) {
					free(ntp_server);
					ntp_server = strdup(body["ntpServer"]);
					preferences.putString("ntpServer", ntp_server);
				}
				if(body.containsKey("displayMode") && body["displayMode"].is<int>()) {
					current_mode = MODE_CLOCK;
					preferences.putInt("clock_mode", current_clock_mode);
					current_clock_mode = body["displayMode"] > CLOCK_TYPE_NUMBER ? CLOCK_ANALOG : static_cast<clock_type>(body["displayMode"]);
					preferences.putInt("current_mode", current_mode);
				}
				if(body.containsKey("time") && body["time"].is<int>() && body["time"] > 0) {
					rtc_int.setTime(body["time"]);
					if(rtc_ext_enabled) {
						ms_rtc_ext_adjust = millis() + 1000;
						rtc_ext_adjust = true;
					}
				}

				//get current time from ntp server if wanted with new settings
				if(update_time && WiFi.waitForConnectResult(50) == WL_CONNECTED) {
					configTzTime(timezone, ntp_server);
					ms_rtc_ext_adjust = millis() + 10000;
					rtc_ext_adjust = true;
				}
				
				preferences.end();
				display_change = true;
				request->send(200, "application/json");
			} else {
				request->send(403, "application/json");
			}
		}));
	}
}

// Initialize Wifi if enabled
void wifi_setup() {

	WiFi.setHostname(WIFI_HOSTNAME);
	WiFi.setAutoReconnect(true);
	ms_wifi_reconnect = millis() + 60000;
	wifi_setup_complete = true;

	if(wifi_connect) {
		WiFi.begin(wifi_ssid, wifi_password);
		WiFi.waitForConnectResult(250);
		wifi_setup_complete = false;
	}
	
	if(wifi_host) {
		WiFi.softAP(wifi_ap_ssid, wifi_ap_password);
		//TODO DNS not yet working
		dnsServer.setTTL(300);
		dnsServer.setErrorReplyCode(AsyncDNSReplyCode::ServerFailure);
		dnsServer.start(53, "*", WiFi.softAPIP());
	}
}

//Load preferences from flash
void preferences_load() {

	preferences.begin(PREFERENCES_NAMESPACE, false);
	
	//settings
	if(preferences.isKey("brightness"))
		brightness = preferences.getShort("brightness", brightness);
	if(preferences.isKey("current_mode"))
		current_mode = static_cast<display_mode>(preferences.getInt("current_mode", current_mode));
	
	//wifi
	if(preferences.isKey("wifi_connect"))
		wifi_connect = preferences.getBool("wifi_connect", WIFI_CONNECT_DEFAULT);

	if(preferences.isKey("wifi_host"))
		wifi_host = preferences.getBool("wifi_host", WIFI_HOST_DEFAULT);
	
	if(preferences.isKey("wifi_ssid")) {
		free(wifi_ssid);
		wifi_ssid = strdup(preferences.getString("wifi_ssid", WIFI_SSID_DEFAULT).c_str());
	}
	
	if(preferences.isKey("wifi_ap_ssid")) {
		free(wifi_ap_ssid);
		wifi_ap_ssid = strdup(preferences.getString("wifi_ap_ssid", WIFI_AP_SSID_DEFAULT).c_str());
		}

	if(preferences.isKey("wifi_password")) {
		free(wifi_password);
		wifi_password = strdup(preferences.getString("wifi_password", WIFI_PASSWORD_DEFAULT).c_str());
		}

	if(preferences.isKey("wifi_ap_password")) {
		free(wifi_ap_password);
		wifi_ap_password = strdup(preferences.getString("wifi_ap_password", WIFI_AP_PASSWORD_DEFAULT).c_str());
	}

	//ntp
	if(preferences.isKey("ntpServer")) {
		free(ntp_server);
		ntp_server = strdup(preferences.getString("ntpServer", ntp_server).c_str());
	}

	if(preferences.isKey("timezone")) {
		free(timezone);
		timezone = strdup(preferences.getString("timezone", timezone).c_str());
	}

	if(preferences.isKey("update_time"))
		update_time = preferences.getBool("update_time", update_time);

	if(preferences.isKey("time_format24"))
		time_format24 = preferences.getBool("time_format24", time_format24);

	//Server
	if(preferences.isKey("api_key")) {
		free(api_key);
		api_key = strdup(preferences.getString("api_key", api_key).c_str());
	} else {
		free(api_key);
		api_key = strdup(generate_uid());
		preferences.putString("api_key", api_key);
	}

	//APIs
	if(preferences.isKey("socials_request")) {
		free(socials_request);
		socials_request = strdup(preferences.getString("socials_request", socials_request).c_str());
	}

	if(preferences.isKey("socials_api_key")) {
		free(socials_api_key);
		socials_api_key = strdup(preferences.getString("socials_api_key", socials_api_key).c_str());
	}

	if(preferences.isKey("socials_server")) {
		free(socials_request_server);
		socials_request_server = strdup(preferences.getString("socials_server", socials_request_server).c_str());
	}

	if(preferences.isKey("current_social"))
		socials_channel_current = preferences.getInt("current_social", socials_channel_current);

	//clock
	if(preferences.isKey("clock_mode"))
		current_clock_mode = static_cast<clock_type>(preferences.getInt("clock_mode", current_clock_mode));
	
