DerEffi/pixelart/esp32/Pixelart/src/main.cpp
	if(preferences.isKey("clock_seconds"))
		clock_seconds = preferences.getBool("clock_seconds", clock_seconds);
		
	if(preferences.isKey("clock_blink"))
		clock_blink = preferences.getBool("clock_blink", clock_blink);
		
	if(preferences.isKey("clock_year"))
		clock_year = preferences.getBool("clock_year", clock_year);


	preferences.end();
}

//Init rtc
void time_setup() {

	setenv("TZ", timezone, 1);
	tzset();
	if(rtc_ext.begin()) {
		rtc_ext.disable32K();
		rtc_ext.disableAlarm(1);
		rtc_ext.disableAlarm(2);
		rtc_ext.clearAlarm(1);
		rtc_ext.clearAlarm(2);
		rtc_ext_enabled = true;
		rtc_internal_adjust();
	}
}

void booted_setup() {
	btn1_pressed = false;
	btn2_pressed = false;
	btn3_pressed = false;
	rot1_pressed = false;
	rot2_pressed = false;
	rot3_pressed = false;
	rot1_clicks = 0;
	rot2_clicks = 0;
	rot3_clicks = 0;
	booted = true;

	display_current();
}

void setup() {
	Serial.begin(9600); //TODO remove after testing

	preferences_load();
	gpio_setup();
	time_setup();
	wifi_setup();
	server_setup();
	panel_setup();
	
	booted_setup(); //TODO move after boot sequence if implemented
}




/***********
**	Loop  **
************/

void loop() {

	ms_current = millis();

	//display changes
	if(booted) {

		//diashow speed rot
		if(rot1_clicks != 0) {

			rot1_clicks = 0;
		}

		//animation speed rot
		if(rot2_clicks != 0) {
			//TODO

			rot2_clicks = 0;
		}

		//brightness rot
		if(rot3_clicks != 0) {

			if((rot3_clicks > 0 && brightness < 248) || (rot3_clicks < 0 && brightness > 24)) {
				brightness += rot3_clicks * 8;
			}
			overlay = OVERLAY_BRIGHTNESS;
			ms_overlay = ms_current + 3000;
			panel->setPanelBrightness(brightness);
			display_change = true;

			preferences.begin(PREFERENCES_NAMESPACE);
			preferences.putShort("brightness", brightness);
			preferences.end();

			rot3_clicks = 0;
		}

		//next button
		if(btn1_pressed) {
			if(current_mode == MODE_SOCIALS) {
				socials_channel_current = socials_channel_current + 1 >= socials_channels.size() ? 0 : socials_channel_current + 1;
				preferences.begin(PREFERENCES_NAMESPACE);
				preferences.putInt("current_social", socials_channel_current);
				preferences.end();
				display_change = true;
			} else if(current_mode == MODE_CLOCK) {
				current_clock_mode = static_cast<clock_type>((current_clock_mode + 1) % CLOCK_TYPE_NUMBER);
				preferences.begin(PREFERENCES_NAMESPACE);
				preferences.putInt("clock_mode", current_clock_mode);
				preferences.end();
				display_change = true;
			}

			btn1_pressed = false;
		}

		//mode button
		if(btn2_pressed) {
			current_mode = static_cast<display_mode>((current_mode + 1) % DISPLAY_MODE_NUMBER);
			display_change = true;

			preferences.begin(PREFERENCES_NAMESPACE);
			preferences.putInt("current_mode", static_cast<int32_t>(current_mode));
			preferences.end();
			
			btn2_pressed = false;
		}

		//menu button
		if(btn3_pressed) {
			//approve api key for server if requested
			if(ms_api_key_request > ms_current) {
				ms_api_key_approve = ms_current + 5000;
				ms_api_key_request = 0;
			}
			
			btn3_pressed = false;
		}


		//rot1 button
		if(rot1_pressed) {
			//TODO
			
			rot1_pressed = false;
		}

		//rot2 button
		if(rot2_pressed) {
			//TODO
			
			rot2_pressed = false;
		}

		//rot3 button
		if(rot3_pressed) {
			//TODO
			
			rot3_pressed = false;
		}


		//check overlay time
		if(ms_overlay != 0 && ms_overlay < ms_current) {
			overlay = OVERLAY_NONE;
			ms_overlay = 0;
			display_change = true;
		}

		if(current_mode == MODE_CLOCK && ms_clock < ms_current) {
			ms_clock = ms_current + 1000;
			display_change = true;
		}

		//refresh display if needed
		if(display_change) {
			display_change = false;
			display_current();
		}
	}

	//Wifi routine
	if(!wifi_setup_complete && ms_wifi_routine <= ms_current) {
		ms_wifi_routine = ms_current + 5000;
		if(WiFi.waitForConnectResult(100) == WL_CONNECTED) {
			wifi_setup_complete = true;
			wifi_on_connected();
		} else if(ms_wifi_reconnect <= ms_current) {
			wifi_setup();
		}
	}

	//RTC adjustment after message received
	if(rtc_ext_adjust && ms_rtc_ext_adjust <= ms_current) {
		rtc_external_adjust();
	}

	//Execute reset from api request
	if(requested_reset) {
		ESP.restart();
	}

	//Routine for async http
	if(socials_response_check != 0 && socials_response_check <= ms_current) {
		if(http_socials.readyState() == readyStateDone) {
			socials_response_check = 0;
			on_socials_response();
		} else {
			socials_response_check += 250;
		}
	} else if(current_mode == MODE_SOCIALS && ms_socials_request != 0 && ms_socials_request <= ms_current) {
		ms_socials_request = ms_current + SOCIAL_REFRESH_INTERVAL;
		socials_refresh();
	}

	//TODO remove tests
	if(ms_test <= ms_current) {
		ms_test = ms_current + 2500;
		
		// Serial.println(WiFi.localIP().toString());
		// Serial.println(rtc_int.getTime());
		// Serial.println(rtc_ext.now().timestamp());
		// Serial.println(api_key);
		// Serial.println(http_socials.readyState());
		// Serial.println(socials_response.size());
		// Serial.println(brightness);

		// uint32_t heap = ESP.getFreeHeap();
		// if(heap != lastHeap) {
		// 	Serial.println(heap);
		// 	lastHeap = heap;
		// }

		sd_connected();
	}
}